import 'package:flutter/material.dart';
import './models/category.dart';
import './models/trip.dart';
import 'models/Places.dart';

const Categories_data = const [
  Category(
    id: 'c1',
    title: 'جبال',
    imageUrl:
        'https://images.unsplash.com/photo-1575728252059-db43d03fc2de?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NTh8fG1vdW5hdGluc3xlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=',
  ),
  Category(
    id: 'c2',
    title: 'بحيرات',
    imageUrl:
        'https://images.unsplash.com/photo-1501785888041-af3ef285b470?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NHx8bGFrZXxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
  Category(
    id: 'c3',
    title: 'شواطىء',
    imageUrl:
        'https://images.unsplash.com/photo-1493558103817-58b2924bce98?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MTAxfHxiZWFjaHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
  Category(
    id: 'c4',
    title: 'صحارى',
    imageUrl:
        'https://images.unsplash.com/photo-1473580044384-7ba9967e16a0?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8ZGVzZXJ0fGVufDB8fDB8&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
  Category(
    id: 'c5',
    title: 'مدن تاريخية',
    imageUrl:
        'https://images.unsplash.com/photo-1467269204594-9661b134dd2b?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NjR8fHRyYXZlbHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
  Category(
    id: 'c6',
    title: 'أخرى',
    imageUrl:
        'https://images.unsplash.com/photo-1605540436563-5bca919ae766?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8c2tpaW5nfGVufDB8fDB8&ixlib=rb-1.2.1&auto=format&fit=crop&w=400&q=60',
  ),
];

const Trips_data = const [
  Trip(
    id: 'm1',
    categories: [
      'c1',
    ],
    title: 'جبال الألب',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1611523658822-385aa008324c?ixid=MXwxMjA3fDB8MHxzZWFyY2h8N3x8bW91bmF0aW5zfGVufDB8fDB8&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60',
    duration: 20,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار سيت أميت ,كونسيكتيتور أدايبا يسكينج أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار سيت أميت ,تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: false,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm2',
    categories: [
      'c1',
    ],
    title: 'جبال الجنوب',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1612456225451-bb8d10d0131d?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MjZ8fG1vdW5hdGluc3xlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60',
    duration: 10,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: false,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm3',
    categories: [
      'c1',
    ],
    title: 'جبال مرتفعة',
    tripType: TripType.Recovery,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1592221912790-2b4df8882ea9?ixid=MXwxMjA3fDB8MHxzZWFyY2h8Mzd8fG1vdW5hdGluc3xlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60',
    duration: 45,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: false,
    isForFamilies: false,
    isInWinter: true,
  ),
  Trip(
    id: 'm4',
    categories: [
      'c2',
      'c1',
    ],
    title: 'البحيرة الكبرى',
    tripType: TripType.Activities,
    season: Season.Spring,
    imageUrl:
        'https://images.unsplash.com/photo-1476514525535-07fb3b4ae5f1?ixid=MXwxMjA3fDB8MHxzZWFyY2h8OXx8bGFrZXxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60',
    duration: 60,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: false,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm5',
    categories: [
      'c2',
      'c1',
    ],
    title: 'البحيرات الصغرى',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1580100586938-02822d99c4a8?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MjF8fGxha2V8ZW58MHx8MHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 15,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: true,
  ),
  Trip(
    id: 'm6',
    categories: [
      'c2',
    ],
    title: 'بحيرة الزمرد',
    tripType: TripType.Exploration,
    season: Season.Summer,
    imageUrl:
        'https://images.unsplash.com/photo-1501785888041-af3ef285b470?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NHx8bGFrZXxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 240,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm7',
    categories: [
      'c3',
    ],
    title: 'شاطئ الأول',
    tripType: TripType.Exploration,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1493558103817-58b2924bce98?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MTAxfHxiZWFjaHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 20,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm8',
    categories: [
      'c3',
    ],
    title: 'الشاطىء الكبير',
    tripType: TripType.Recovery,
    season: Season.Spring,
    imageUrl:
        'https://images.unsplash.com/photo-1519046904884-53103b34b206?ixid=MXwxMjA3fDB8MHxzZWFyY2h8Mnx8YmVhY2h8ZW58MHx8MHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60',
    duration: 35,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: true,
  ),
  Trip(
    id: 'm9',
    categories: [
      'c3',
    ],
    title: 'شاطىء الصخور',
    tripType: TripType.Exploration,
    season: Season.Summer,
    imageUrl:
        'https://images.unsplash.com/photo-1519602035691-16ac091344ef?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MjE1fHxiZWFjaHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 45,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: false,
    isInWinter: false,
  ),
  Trip(
    id: 'm10',
    categories: [
      'c4',
    ],
    title: 'الصحراء الكبرى',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1473580044384-7ba9967e16a0?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8ZGVzZXJ0fGVufDB8fDB8&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm11',
    categories: [
      'c4',
      'c1',
    ],
    title: 'الصحراء الغربية',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1469854523086-cc02fe5d8800?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MTB8fHRyYXZlbHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm12',
    categories: [
      'c4',
    ],
    title: 'الصحراء الرملية',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1452022582947-b521d8779ab6?ixid=MXwxMjA3fDB8MHxzZWFyY2h8ODN8fGRlc2VydHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm13',
    categories: [
      'c5',
    ],
    title: 'المدينة الأولى',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1498307833015-e7b400441eb8?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NDJ8fHRyYXZlbHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm14',
    categories: [
      'c5',
    ],
    title: 'المدينة الثانية',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1467269204594-9661b134dd2b?ixid=MXwxMjA3fDB8MHxzZWFyY2h8NjR8fHRyYXZlbHxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm15',
    categories: [
      'c5',
    ],
    title: 'المدينة القديمة',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1519923041107-e4dc8d9193da?ixid=MXwxMjA3fDB8MHxzZWFyY2h8Njd8fG9sZCUyMGNpdHl8ZW58MHx8MHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm16',
    categories: [
      'c6',
    ],
    title: 'رياضة التثلج',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1605540436563-5bca919ae766?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MXx8c2tpaW5nfGVufDB8fDB8&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
  Trip(
    id: 'm17',
    categories: [
      'c6',
      'c2',
    ],
    title: 'القفز المظلي',
    tripType: TripType.Activities,
    season: Season.Winter,
    imageUrl:
        'https://images.unsplash.com/photo-1601024445121-e5b82f020549?ixid=MXwxMjA3fDB8MHxzZWFyY2h8MTJ8fHBhcmFjaHV0ZSUyMGp1bXBpbmd8ZW58MHx8MHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=600&q=60',
    duration: 30,
    activities: [
      'زيارة المواقع الأثرية',
      'جولة سياحية على الأقدام',
      'زيارة المراكز التجارية للتبضع',
      'تناول وجبة الغداء',
      'استمتاع المناظر الجملية'
    ],
    program: [
      'أليايت,سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'يسكينج أليايت سيت دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
      'لوريم ايبسوم دولار ات دولار ماجنا أليكيوا.',
      'لور دو أيوسمود تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا.',
    ],
    isInSummer: true,
    isForFamilies: true,
    isInWinter: true,
  ),
];
const places = const [
  Place(
      name: "الأهرامات",
      imageUrl:
          'https://media.algomhor.com/ArticleUpload/2024/5/18/%D8%A7%D9%8A%D9%86-%D8%AA%D9%82%D8%B9-%D8%A7%D9%84%D8%A7%D9%87%D8%B1%D8%A7%D9%85%D8%A7%D8%AA-%D9%81%D9%8A_1701_015252.jpg',
      description:
          '''أهرامات القاهرة، والمعروفة أيضًا باسم أهرامات الجيزة، هي هياكل قديمة بنيت خلال فترة المملكة القديمة في مصر القديمة، حوالي 2580-2560 قبل الميلاد. تم بناؤها كمقابر للفراعنة، وكان الهرم الأكبر بالجيزة هو الأكبر حيث يبلغ ارتفاعه حوالي 146 مترًا. تعتبر هذه الأهرامات، التي تتماشى بدقة مع النقاط الأساسية للبوصلة، مناطق جذب سياحي رئيسية اليوم، حيث تجتذب ملايين الزوار سنويًا. بجوار الأهرامات يقف تمثال أبو الهول بالجيزة، وهو رمز آخر لمصر القديمة. وعلى الرغم من عمرها، فإن الجهود مستمرة للحفاظ على هذه الهياكل الرائعة وحمايتها.

أوقات الزيارة: يومياً من الساعة 7 صباحاً وحتى الساعة 5 عصراً.

سعر التذاكر: الكبار 60 جنيهًا مصريًا، الطلاب 30 جنيهًا مصريًا. أيضاً هناك دخول مجاني للأطفال أقل من 6 سنوات، للمصريين والعرب وذوي الاحتياجات الخاصة وللمصريين والعرب فوق 60 سنة.

الموقع على الخريطة

نوصيك بتجربة التجول حول الإهرامات إما عبر الحنطور أو الخيول من المؤكد أنك ستحظى بجولة رائعة وتلتقط العديد من الصور المميزة.'''),
  Place(
      name: "مسجد الأزهر الشريف",
      imageUrl:
          'https://www.azhar.eg/Portals/15/EasyDNNNews/44971/600600p2232EDNmainimg-resize-(1).jpg',
      description:
          '''لهواة الهندسة المعمارية الإسلامية، يُعَدُّ جامع الأزهر وجهة لا بد من زيارتها. يعود تأسيسه إلى الفاطمي جوهر الصقيلي في عام 970، وهو الآن يشكل مزيجًا مذهلاً من الأساليب والفترات المختلفة. على سبيل المثال، يعود جدار القبلة إلى القرن الرابع عشر، وأضاف السلطان قايتباي إحدى المآذن عام 1475، وتعود الواجهة الرئيسية إلى القرن التاسع عشر، بينما تعود البوابة المزدوجة المقوسة إلى منتصف القرن الثامن عشر.

إذ يمكن للزائر أن يستمتع بالمعالم المعمارية الفاطمية والمملوكية والعثمانية المتداخلة في هذا المبنى الرائع. ويجب أن نذكر أن مجمع المساجد والمدرسة بالأزهر هو أحد أقدم الجامعات في العالم. ويتميز الأزهر بطابعه المعماري الفريد الذي يعكس تاريخ الفن الإسلامي، ويكمن جزء من فرادته في كونه كان مركزًا للدراسات اللاهوتية الشيعية حتى الستينيات من القرن الثاني عشر، قبل أن يُعاد افتتاحه كمؤسسة سنية. سُمي الجامع بالأزهر تيمنًا بالسيدة فاطمة الزهراء، ابنة رسول الله، وهو يُعَدُّ منارةً لعلماء الإسلام في جميع أنحاء العالم.

الموقع على الخريطة

من الأفضل تجنب زيارة مسجد الأزهر الشريف خلال العطلات وإجازات نصف العام الدراسي بسبب الازدحام الشديد. ويُوصى بزيارته في الصباح الباكر لتفادي الازدحام.'''),
  Place(
      name: " حديقة الأزهر",
      imageUrl:
          'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQij0ICAaO-mirNPvOj22g-PXwuqRZEuiBs4aftNXSGDCOkQtaPPADLDTAIVMb4wG2pOGo&usqp=CAU',
      description:
          '''تأسست حديقة الأزهر في العام 1984 على يد سمو الآغا خان، بهدف الاحتفال بتأسيس القاهرة على يد الفاطميين عام 969. اختير موقع الحديقة على أرض الدراسة المهجورة، وقد تم افتتاحها للجمهور في عام 2005. يقع الموقع بين أسوار المدينة القديمة و"مدينة الموتى"، وتحيط بها بقايا سور المدينة الأول الذي بني في عهد جوهر السجللي عام 969، وتم توسيعه في القرون اللاحقة، وهي الآن واحدة من أفضل الحدائق في العالم، تستقطب أكثر من مليون زائر سنويًا.

أوقات الزيارة: يومياً من الساعة 9 صباحاً إلى الساعة 10 مساءً.

رسوم الدخول: من الأحد إلى الخميس: الكبار 40 جنيه مصري، الأطفال من 2 إلى 8 سنوات: 30 جنيه مصري. الجمعة والسبت: الكبار 45 جنيه مصري، الأطفال: 30 جنيه مصري.'''),
  Place(
      name: "قلعة القاهرة ",
      imageUrl:'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRdzUnC12TaCWVPCQNaK_NGBbDuwax44z4D6g&s',
      description:
          '''تتميز قلعة السلطان صلاح الدين الأيوبي، وهي قلعة ضخمة في القاهرة الإسلامية، بحضور قوي على قمة تلال المقطم. أنشأه صلاح الدين الأيوبي في البداية عام 1176 م، وأصبح المقر الرسمي لحكام مصر في عهد السلطان الكامل بن العادل عام 1207 م. على الرغم من أهميتها التاريخية، تحول دور القلعة كمقر للسلطة إلى قصر عابدين في القرن التاسع عشر. وهي شاهدة على لحظات محورية في التاريخ المصري، وهي تقدم الآن للزوار ثروة من المعالم السياحية، بما في ذلك مسجد محمد علي باشا الشهير وغيره من المواقع البارزة مثل مسجد الناصر محمد بن قلاوون ومسجد سليمان باشا الخادم. بالإضافة إلى أنها تضم عدة متاحف، منها متحف الشرطة، ومتحف قصر الجوهرة، والمتحف الحربي.

أوقات الزيارة: يومياً من الساعة 8 صباحاً وحتى الساعة 5 عصراً.

سعر التذاكر: تذكرة دخول المنطقة: المصريون/ العرب: كبار: 60 جنيهًا مصريًا، الطلاب: 30 جنيهًا مصريًا. العربة: المصريين والعرب: 5 جنيهات مصرية. تذكرة السيارات: التاكسي: 10 جنيهات مصرية / ميني باص: 20 جنيهًا مصريًا / الأتوبيس: 40 جنيهًا مصريًا'''),
  Place(
      name: "قصر البارون إمبان",
      imageUrl:'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcToq8bjfwUrGgvLFOrI0yGpi_7ciD4iani6DQ&s'
      ,description:
          '''قصر البارون إمبان، بتصميم هندي مميز وبرجه البارز في صحراء مصر الجديدة، يشكل معلمًا بارزًا في العاصمة. أُنشئ في فترة 1907-1911م من قبل إدوارد لويس جوزيف إمبان، البارون البلجيكي المشهور، وتولى تصميمه المهندس المعماري الفرنسي ألكساندر مارسيل. يتألف القصر من بدروم وطابقين، مع سطح، ويحيط به حديقة واسعة. يضم البدروم مساكن للخدم، بينما يتخلل مبنى القصر سلم حلزوني ومصعد يربط بين الأدوار. يحتوي الدور الأرضي على غرف استقبال وطعام وبيلياردو، بينما يحتوي الدور الأول على أربع غرف مع شُرُف وحمامات. يتميز سطح القصر بإطلالاته الرائعة ويعتبر جزءًا من برج القصر المميز.

أوقات الزيارة: يومياً من الساعة 9 صباحاً وحتى الساعة 4.30 عصراً.

سعر التذاكر: المصريين والعرب: الكبار: 60 جنيه مصري، الطلاب 30 جنيه مصري. بانوراما سطح القصر: للأجانب: 120 جنيه مصري، المصريين 30 جنيه مصري'''),
  Place(
      name: " المتحف القومي للحضارة المصرية",
      imageUrl:'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRYqBnkxJecVlByIeGkkBMLM7pHHr7FRz2NdQ&s',
      description:
          '''المتحف القومي للحضارة المصرية يعتبر المتحف الأول من نوعه في مصر والعالم العربي، ويُعد مجمعًا حضاريًا عالميًا متكاملاً يتيح لزواره فرصة استكشاف الحضارات المصرية المتعاقبة. بدأت فكرة إنشائه في عام 1982 بناءً على طلب من الحكومة المصرية، وتم وضع حجر الأساس في عام 2002. افتتحت بعض القاعات في عام 2017، وافتتح رسميًا العام 2021 و2022، ويضم مجموعة متنوعة من القطع الأثرية التي تمثل تراث مصر عبر العصور المختلفة، بدءًا من العصور القديمة وصولاً إلى العصر الحديث. يتضمن المتحف أيضًا قاعات للمومياوات وللنسيج المصري، ويستضيف مدرسة الحضارة المصرية لزيادة الوعي الثقافي والأثري بين المواطنين والزوار الأجانب.

أوقات الزيارة: يومياً من الساعة 9 صباحاً وحتى الساعة 5 عصراً.

سعر التذاكر: الأجانب: الكبار 240 جنيهاً مصرياً، الطلاب: 120 جنيهاً مصرياً، المصريين: الكبار 60 جنيهًا مصريًا / الطلاب: 30 جنيهًا مصريًا، دخول مجاني للأطفال حتى 6 سنوات. الدليل الصوتي: 30 جنيهًا مصريًا'''),
  Place(
      name: "المتحف المصري الكبير",
      imageUrl:'https://img.youm7.com/ArticleImgs/2022/12/22/38371-%D8%A7%D9%84%D9%85%D8%B3%D9%84%D8%A9-%D8%A7%D9%84%D9%85%D8%B9%D9%84%D9%82%D8%A9.jfif',
      description:
          '''المتحف المصري هو أقدم متحف أثري في الشرق الأوسط، ويضم أكبر مجموعة من الآثار المصرية القديمة في العالم، تبدأ من فترة ما قبل الأسرات إلى العصرين اليوناني والروماني. تم تصميم المبنى من قبل المهندس المعماري الفرنسي مارسيل دورغنون بعد فوزه في مسابقة دولية عام 1895. افتتح المتحف في عام 1902 على يد الخديوي عباس حلمي الثاني، وأصبح معلمًا تاريخيًا في وسط القاهرة. يتميز المتحف بمجموعة كبيرة من القطع الأثرية النادرة، بما في ذلك المجموعة الجنائزية ليويا وتويا، وتماثيل الفراعنة العظماء مثل خوفو وخفرع ومنكاورع، بالإضافة إلى البرديات والتوابيت والحلي التي تكمل مجموعة المتحف.

أوقات الزيارة: يومياً من الساعة 9 صباحاً وحتى الساعة 5 مساءً.

سعر التذاكر: المصريين والعرب: كبار: 30 جنيهاً مصرياً، الطلاب 10 جنيهات مصرية، المرشد السمعي للمصري: 30 جنيهاً مصرياً، للأجنبي 50 جنيهاً مصرياً، الدخول مجانا للأطفال حتى 6 سنوات'''),
  Place(
      name: "متحف الفن الإسلامي",
      imageUrl:'https://dynamic-media-cdn.tripadvisor.com/media/photo-o/27/14/b7/a6/caption.jpg?w=1200&h=-1&s=1&cx=1243&cy=1464&chk=v1_871e24301afcf61fb437',
      description:
          '''يضم متحف الفن الإسلامي أكبر وأروع مجموعة من الآثار الإسلامية على مستوى العالم، وافتتح في عام 1903م في عهد الخديوي عباس حلمي الثاني. تضرر المتحف في حادث تفجير عام 2014م، لكنه تم تجديده وافتتاحه مرة أخرى في عام 2017م. يتكون من طابقين ويضم أكبر مجموعة للقطع الإسلامية، تسمح للزائر بالتجول عبر جميع فترات التاريخ الإسلامي، مع مواد صنعها متنوعة من فلك وطب وعمارة، وتشمل قطع خشبية محفورة وخزف مزخرف ومخطوطات نادرة. يضم أيضًا كنوزًا مثل مفتاح الكعبة من العصر المملوكي وقطعة نسيج تحمل أقدم كتابة كوفية.

أوقات الزيارة: يومياً من الساعة 9 صباحاً وحتى الساعة 5 عصراً.

سعر التذاكر: للمصريين والعرب: الكبار 20 جنيهاً مصرياً، للطلاب 10 جنيهات مصرية'''),
  Place(
      name: "متحف نجيب محفوظ ",
      imageUrl:'https://img.youm7.com/large/20230302022401241.jpg',
      description:
          '''تم تخصيص تكية محمد أبو الدهب بجامع محمد أبو الذهب بالأزهر لصندوق التنمية الثقافية ليكون مركزاً ومتحفاً للأديب الكبير نجيب محفوظ، وبدأت الأعمال في عام 2016 لتجهيز المبنى، الذي يعود تاريخه إلى نهاية القرن الثامن عشر الميلادي. وتم اختيارها تحديداً لقربه من المنزل الذي وُلد فيه محفوظ بحي الجمالية في القاهرة، ولكونه يتوسط منطقة القاهرة التاريخية التي استوحى منها الأديب الراحل شخصيات وأماكن أغلب رواياته. المتحف يحتوي على مجموعة من الكتب والمقتنيات الشخصية لنجيب محفوظ، بالإضافة إلى قطع تاريخية تعود إلى عصور مختلفة.

أوقات الزيارة: يومياً ما عدا الثلاثاء من الساعة 9 صباحاً وحتى الساعة 5 عصراً'''),
  Place(
      name: "متحف أحمد شوقي",
      imageUrl:'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTB-Nkd92aeZIA0f9-2GMnK9osC73ByKkhurA&s',
      description:
          '''يعد متحف أحمد شوقي في الجيزة من أهم متاحف الأدباء في العالم العربي، حيث يتمتع بقيمة أدبية عالية نظرًا لتاريخ شوقي الشعري المميز. بني المتحف في المنزل الذي عاش فيه شوقي وأسرته على ضفاف النيل، وتم افتتاحه كمتحف في عام 1977 بقرار من الرئيس السادات. يتأثر شوقي بالأجواء الإسبانية ويتجلى ذلك في الطابع المعماري للمنزل والحدائق المحيطة به، وقد أطلق عليه اسم "كرمة ابن هانئ". يضم المتحف تمثالًا لشوقي وتمثالًا آخر في حديقته يعود للذكرى الخمسين لوفاته.

أوقات الزيارة: يومياً ما عدا الجمعة والسبت من الساعة 10 صباحاً وحتى الساعة 3 عصراً.

سعر التذاكر: 10 جنيهات مصرية لغير المصريين'''),
  Place(
      name: "متحف أم كلثوم",
      imageUrl:
          'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRuI2x9FfetTTA4I7rtWVYvyKH_TU9Q018ULg&s',
      description:
          '''تم افتتاح متحف أم كلثوم كتكريم لدورها الفني والثقافي البارز وتراثها الغني. يقع المتحف في قصر المانسترلي بمنطقة الروضة على ضفاف النيل بمساحة 250 متر مربع، وقد بدأت الجهود لإنشاءه في أبريل 1998. يحتوي المتحف على مقتنيات شخصية وفنية ووثائق تاريخية تعكس مسيرة أم كلثوم، بالإضافة إلى قاعات عرض لأفلامها وصورها وأعمالها الفنية، ومكتبة سمعية بصرية. يهدف المتحف إلى إلهام الجمهور ونقل تراثها إلى الأجيال القادمة.

أوقات الزيارة: يومياً من الساعة 8 صباحاً وحتى الساعة 4 عصراً، ما عدا يوم الأحد يغلق المتحف الساعة 2 ظهراً.

سعر التذاكر: للمصريين 5 جنيه مصري، للطلاب 2 جنيه مصري'''),
  Place(
      name: "دار الأوبرا",
      imageUrl:'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTkDts3QlnaZxUJHqFZSEUBOyHlfC-FiWEe3w&s'
      ,description:
          '''تمثل مصر نقطة تلاقٍ جغرافية وثقافية، حيث استقطبت مختلف الحضارات على مر العصور. في عام 1869، قرر الخديوي إسماعيل إنشاء دار أوبرا تكريمًا لافتتاح قناة السويس. اهتم بتصميم المبنى ليكون تحفة معمارية فريدة، وقد استغرق بناؤه ستة أشهر. رغم رغبته في افتتاحها بأوبرا "عايدة"، إلا أنها تأجلت بسبب الظروف السياسية، وقدمت بدلاً منها أوبرا "ريجوليتو".

تعتبر الأوبرا المنارة الثقافية في المنطقة، ولكن في أكتوبر 1971، احترق المبنى القديم واحتاج مصر إلى مركز ثقافي جديد، فقامت الحكومة بالتعاون مع اليابان بإنشاء دار الأوبرا المصرية، وتم اختيار أرض الجزيرة كموقع لها تم الاتفاق على تصميم معمارى إسلامى حديث يتناغم مع ما يحيط بها من مبان، وافتتحت في عام 1988 كأحدث معالم القاهرة الثقافية وأول دار أوبرا في الشرق الأوسط'''),
  Place(
      name: "متحف قصر عابدين",
      imageUrl:'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSnU9dIMTmDa9g4rKX0VwQIAe15RXfEYVhMLQ&s',
      description:
          '''قصر عابدين كان مقراً لحكم مصر منذ عام 1874 حتى ثورة يوليو 1952. تم بناؤه بأمر من الخديوي إسماعيل كجزء من خطته لبناء قاهرة حديثة. صمم القصر على الطراز الكلاسيكي الأوروبي، وشهد استخدامًا واسعًا للزخارف والديكورات الفخمة. يحتوي القصر على مجموعة من القاعات الرسمية والصالونات، بالإضافة إلى مكتبة تضم الآلاف من الكتب. يُعد القصر تجسيدًا للنفوذ المعماري الغربي في مصر، ويحتوي على مساحات داخلية تتميز بالفخامة والتفاصيل الفنية الدقيقة.

قصر عابدين ليس مجرد متحف واحد، بل يتضمن أربعة متاحف مختلفة: متحف الأسلحة، ومتحف الأوسمة والنياشين، ومتحف الفضيات، ومتحف الوثائق التاريخية. يعد قصر عابدين موقعًا تاريخيًا مهمًا شهد العديد من الأحداث البارزة في تاريخ مصر، مثل حفل افتتاح قناة السويس والمواجهة الشهيرة بين أحمد عرابي والخديوي في عام 1881، وتحول مصر من الملكية إلى الجمهورية في عام 1952، وخطب الرئيس عبد الناصر من شرفة القصر حتى عام 1958 عندما انتقل إلى قصر القبة للحكم منه.

أوقات الزيارة: يومياً ما عدا الجمعة من الساعة 9 صباحاً وحتى الساعة 3 عصراً.

سعر التذاكر: للكبار 20 جنيهاً مصرياً، وللطلاب 5 جنيه مصري.'''),
  Place(
      name: " خان الخليلي",
      imageUrl:'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTYEfB03jXFy8026eQ9-yxawFQstI1pEhv9Gg&s',
      description:
          '''سوق خان الخليلي في القاهرة، مصر، تأسس عام 1382 ويُعتبر واحدًا من أهم المعالم السياحية في المدينة. يضم المئات من الأكشاك التي تبيع مجموعة متنوعة من السلع، بدءًا من الهدايا التذكارية وصولاً إلى التوابل المحلية والمصنوعات اليدوية. يُعتبر سوقًا تاريخيًا يعود تاريخه لقرون مضت، حيث استخدم كمكان للتجمع السياسي خلال العصر المملوكي، ويُعتبر اليوم أكبر سوق في منطقة الشرق الأوسط، حيث يحتوي على أكثر من 4000 متجر.'''),
  Place(
      name: "خان المعز لدين الفاطمي",
      imageUrl:'https://www.elbalad.news/Upload/libfiles/305/8/18.jpg',
      description:
          '''شارع المعز يعود تاريخه إلى عصر الخليفة الفاطمي المعز لدين الله، وهو الآن أكبر متحف مفتوح للآثار الإسلامية في العالم وموقع تراثي مدرج على قائمة التراث العالمي. يمتد الشارع بين باب الفتوح وباب زويلة، يضم آثارًا تعكس تاريخ مصر الإسلامية من القرن العاشر حتى القرن التاسع عشر، بما في ذلك مباني دينية وسكنية وتجارية ودفاعية، بالإضافة إلى الأسواق ومحلات الحرف التقليدية.

الموقع على الخريطة

يمكنك رؤية آثار الدولة الفاطمية خلال مسيرك من خان المعز إلى قلعة صلاح الدين الأيوبي بمشهد تاريخي رائع فلا تفوته.'''),
  Place(
      name: " مول مصر",
      imageUrl:'https://aqarsky.com/wp-content/uploads/2024/04/big-572f8cddff9367522200f0cc-573c69a6e1e5f-1bjoqd6_InPixio-1.jpg',
      description:
          '''مول مصر هو أكثر من مجرد مركز للتسوق؛ إنها تجربة في حد ذاتها. يضم هذا المركز التجاري مساحة واسعة للبيع بالتجزئة تبلغ أكثر من 160.000 متر مربع، وهو موطن لأكثر من 400 علامة تجارية عالمية ومحلية، ويقدم مجموعة واسعة من المنتجات التي تناسب جميع الأذواق والميزانيات. سواء كنت في السوق لشراء الأزياء الراقية، أو الإلكترونيات، أو مستحضرات التجميل، أو ديكور المنزل، ستجد كل ذلك تحت سقف واحد.

سوف يسعد عشاق الموضة بوجود علامات تجارية عالمية مشهورة، بينما يمكن للباحثين عن المنتجات المصرية الأصيلة استكشاف مجموعة متنوعة من المحلات المحلية التي تعرض الحرف والتصميمات التقليدية. تم تصميم المركز التجاري بعناية لتلبية الاحتياجات والتفضيلات المتنوعة لزواره، مما يجعله وجهة لا بد من زيارتها لكل من السكان المحليين والسياح.

أوقات العمل: يومياً من الساعة 10 صباحاً وحتى الساعة 11 مساءً، ما عدا يوميّ الخميس والجمعة يغلق المول الساعة 12 منتصف الليل.'''),
  Place(
      name: "برج القاهرة",
      imageUrl:'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ3myGRFlAgsPjXxqgy5_0jOow-96NU-gs3Kw&s',
      description:
          '''برج القاهرة هو برج تلفزيون يقع في مدينة القاهرة، عاصمة مصر. تم بناء البرج في عام 1961 وافتتح رسميًا في عام 1961 أيضًا. يبلغ ارتفاع البرج حوالي 187 مترًا، وهو يعتبر واحدًا من أبرز المعالم السياحية في القاهرة. يمكن للزوار الصعود إلى قمة البرج عبر المصعد مقابل رسم دخول، ومن القمة يمكنهم التمتع بإطلالات رائعة على معالم المدينة مثل الأهرامات ونهر النيل ومدينة القاهرة.

أوقات الزيارة: يومياً من الساعة 9 صباحاً وحتى الساعة 1 بعد منتصف الليل.

سعر التذكرة: سعر تذكرة السائح بـ 250 جنيه مصري و 150 جنيه مصري تذكرة للكافيه'''),
];
